src/resources/generateExtraOutcome.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.ws.ck.com/">
  <soapenv:Header>
      <Usuario xmlns="uri:com.ck.engine.ws" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">$username</Usuario>
      <Password xmlns="uri:com.ck.engine.ws" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">$password</Password>
  </soapenv:Header>
  <soapenv:Body>
    <impl:generateExtraOutcome>
       <arg0>$accountId</arg0>
    </impl:generateExtraOutcome>
  </soapenv:Body>
</soapenv:Envelope>